Revit 2027 API
SpatialElementGeometryResults.GetGeometry Method
 The solid from the spatial element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Solid GetGeometry()
Public Function GetGeometry As Solid
public:
Solid^ GetGeometry()
member GetGeometry : unit -> Solid
Return Value
Solid
 Requested solid.
See Also
Reference
SpatialElementGeometryResults Class
Autodesk.Revit.DB Namespace